vvpai9/Keil/Keil_v5/ARM/Pack/.Web/GigaDevice.GD32E23x_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>GigaDevice</vendor>
  <url>https://gd32mcu.com/data/documents/pack/</url>
  <name>GD32E23x_DFP</name>
  <description>GigaDevice GD32E23x Series Device Support and Examples</description>
  <releases>
  <release version="1.0.2" date="2022-07-27">
    Updata url address.
  </release>
  <release version="1.0.1" date="2021-12-07">
    First Release version of GD32E23x Device Family Pack.
  </release>
  <release version="1.0.0" date="2019-03-15">
    First Release version of GD32E23x Device Family Pack.
  </release>
  </releases>
  <keywords>
    <!-- keywords for indexing -->
  <keyword>GigaDevice</keyword>
  <keyword>Device Support</keyword>
  <keyword>GD32E23x</keyword>
  </keywords>

  <devices>
    <!-- ******************************  Cortex-M23  ********************** -->
    <family Dfamily="GD32E23x Series" Dvendor="GigaDevice:123">
      <!--book name="Device/ARM/Documents/??_dgug.pdf"       title="?? Device Generic Users Guide"/-->
    <processor Dcore="Cortex-M23" DcoreVersion="r0p0" Dfpu="0" Dmpu="1" Dtz="NO_TZ" Dendian="Little-endian" />
    <compile header="Device/Include/gd32e23x.h" define="GD32E23x "/>

      <description>
The Arm Cortex-M23 is based on the Armv8-M baseline architecture.
It is the smallest and most energy efficient Arm processor with Arm TrustZone technology.
Cortex-M23 is the ideal processor for constrained embedded applications requiring efficient security.

GD32 is a new 32-bit high performance, low power consumption universal microcontroller family
powered by the ARM Cortex-M23 RISC core,which targeted at various MCU application areas.
GD32 family integrates features to simplify system design and provide customers wide range of
comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
GD32 family includes entry line, performance line and connectivity line currently.
      </description>    

      <!-- ************************  Subfamily 'GD32E230'  **************************** -->
      <subFamily DsubFamily="GD32E230">
   
      <description>
GD32E230 - ARM Cortex-M23 Core
  Frequency up to 72 MHz
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal, 28 external interrupts, each has 4 priority levels

Memories
  Flash size from 16KB to 64 KB
  SRAM size from 4KB to 8 KB with HW parity checking
  3KB ISP loader ROM
  1KB OTP byte

Low power management
  Power saving mode: sleep, deep-sleep, standby mode
  Independent battery supply for real-calendar RTC and backup register

Advanced analog peripherals
  1 x 12bit, 1us ADC (up to 10 chs)

Integrated peripherals interface
  Up to 2 x USART/UART/Irda/LIN/ISO7816
  Up to 2 x SPI (18Mbit/s)
  Up to 2 x I2C (400Kbit/s)

On-chip resources
  1 x 16 bit Advanced Timer, 1 x SysTick Timer, 5 x 16 bit GPTM, 1x 16bit basic Timer, 2 x WDG
  5-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
  System supervisor and reset: POR,PDR,LVD
  80% GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HSI (8MHz), LSI (40KHz)
      </description>

      <feature type="WDT"           n="2"/>
      <feature type="RTC"           n="32768"/>
      <feature type="ADC"           n="1"       m="12"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="VCC"           n="2.40"    m="3.60"/>

      <!-- *************************  Device 'GD32E230C8'  ***************************** -->
      <device Dname="GD32E230C8">
         <memory    id="IROM1"                   start="0x08000000" size="0x0010000" startup="1" default="1"/>
         <memory    id="IRAM1"                   start="0x20000000" size="0x0002000" init   ="0" default="1"/>
         <debug svd="SVD/GD32E230.svd"/>
         <algorithm name="Flash/GD32E23x.FLM" start="0x08000000" size="0x0010000" default="1"/>
      </device>  

      <!-- *************************  Device 'GD32E230C6'  ***************************** -->
      <device Dname="GD32E230C6">
         <memory    id="IROM1"                   start="0x08000000" size="0x0008000" startup="1" default="1"/>
         <memory    id="IRAM1"                   start="0x20000000" size="0x0001800" init   ="0" default="1"/>
       <debug svd="SVD/GD32E230.svd"/>
         <algorithm name="Flash/GD32E23x.FLM" start="0x08000000" size="0x008000" default="1"/>
      </device>  

      <!-- *************************  Device 'GD32E230C4'  ***************************** -->
      <device Dname="GD32E230C4">
         <memory    id="IROM1"                   start="0x08000000" size="0x0004000" startup="1" default="1"/>
         <memory    id="IRAM1"                   start="0x20000000" size="0x0001000" init   ="0" default="1"/>
       <debug svd="SVD/GD32E230.svd"/>
         <algorithm name="Flash/GD32E23x.FLM" start="0x08000000" size="0x004000" default="1"/>
      </device>  

      <!-- *************************  Device 'GD32E230K8'  ***************************** -->
      <device Dname="GD32E230K8">
         <memory    id="IROM1"                   start="0x08000000" size="0x0010000" startup="1" default="1"/>
         <memory    id="IRAM1"                   start="0x20000000" size="0x0002000" init   ="0" default="1"/>
       <debug svd="SVD/GD32E230.svd"/>
         <algorithm name="Flash/GD32E23x.FLM" start="0x08000000" size="0x0010000" default="1"/>
      </device>  

      <!-- *************************  Device 'GD32E230K6'  ***************************** -->
      <device Dname="GD32E230K6">
         <memory    id="IROM1"                   start="0x08000000" size="0x0008000" startup="1" default="1"/>
         <memory    id="IRAM1"                   start="0x20000000" size="0x0001800" init   ="0" default="1"/>
       <debug svd="SVD/GD32E230.svd"/>
         <algorithm name="Flash/GD32E23x.FLM" start="0x08000000" size="0x008000" default="1"/>
      </device>  

