vvpai9/Keil/Keil_v5/ARM/Pack/.Web/GigaDevice.GD32E23x_DFP.pdsc
      <!-- *************************  Device 'GD32E230K4'  ***************************** -->
      <device Dname="GD32E230K4">
         <memory    id="IROM1"                   start="0x08000000" size="0x0004000" startup="1" default="1"/>
         <memory    id="IRAM1"                   start="0x20000000" size="0x0001000" init   ="0" default="1"/>
       <debug svd="SVD/GD32E230.svd"/>
         <algorithm name="Flash/GD32E23x.FLM" start="0x08000000" size="0x004000" default="1"/>
      </device>  

      <!-- *************************  Device 'GD32E230G8'  ***************************** -->
      <device Dname="GD32E230G8">
         <memory    id="IROM1"                   start="0x08000000" size="0x0010000" startup="1" default="1"/>
         <memory    id="IRAM1"                   start="0x20000000" size="0x0002000" init   ="0" default="1"/>
       <debug svd="SVD/GD32E230.svd"/>
         <algorithm name="Flash/GD32E23x.FLM" start="0x08000000" size="0x0010000" default="1"/>
      </device>  

      <!-- *************************  Device 'GD32E230G6'  ***************************** -->
      <device Dname="GD32E230G6">
         <memory    id="IROM1"                   start="0x08000000" size="0x0008000" startup="1" default="1"/>
         <memory    id="IRAM1"                   start="0x20000000" size="0x0001800" init   ="0" default="1"/>
       <debug svd="SVD/GD32E230.svd"/>
         <algorithm name="Flash/GD32E23x.FLM" start="0x08000000" size="0x008000" default="1"/>
      </device>  

      <!-- *************************  Device 'GD32E230G4'  ***************************** -->
      <device Dname="GD32E230G4">
         <memory    id="IROM1"                   start="0x08000000" size="0x0004000" startup="1" default="1"/>
         <memory    id="IRAM1"                   start="0x20000000" size="0x0001000" init   ="0" default="1"/>
       <debug svd="SVD/GD32E230.svd"/>
         <algorithm name="Flash/GD32E23x.FLM" start="0x08000000" size="0x004000" default="1"/>
      </device>  

      <!-- *************************  Device 'GD32E230F8'  ***************************** -->
      <device Dname="GD32E230F8">
         <memory    id="IROM1"                   start="0x08000000" size="0x0010000" startup="1" default="1"/>
         <memory    id="IRAM1"                   start="0x20000000" size="0x0002000" init   ="0" default="1"/>
       <debug svd="SVD/GD32E230.svd"/>
         <algorithm name="Flash/GD32E23x.FLM" start="0x08000000" size="0x0010000" default="1"/>    
      </device>  

      <!-- *************************  Device 'GD32E230F6'  ***************************** -->
      <device Dname="GD32E230F6">
         <memory    id="IROM1"                   start="0x08000000" size="0x0008000" startup="1" default="1"/>
         <memory    id="IRAM1"                   start="0x20000000" size="0x0001800" init   ="0" default="1"/>
       <debug svd="SVD/GD32E230.svd"/>
         <algorithm name="Flash/GD32E23x.FLM" start="0x08000000" size="0x008000" default="1"/>
      </device>  

      <!-- *************************  Device 'GD32E230F4'  ***************************** -->
      <device Dname="GD32E230F4">
         <memory    id="IROM1"                   start="0x08000000" size="0x0004000" startup="1" default="1"/>
         <memory    id="IRAM1"                   start="0x20000000" size="0x0001000" init   ="0" default="1"/>
       <debug svd="SVD/GD32E230.svd"/>
         <algorithm name="Flash/GD32E23x.FLM" start="0x08000000" size="0x004000" default="1"/>
      </device>      
     </subFamily>


   <!-- ************************  Subfamily 'GD32E231'  **************************** -->
      <subFamily DsubFamily="GD32E231">
   
      <description>
GD32E231 - ARM Cortex-M23 Core
  Frequency up to 72 MHz
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal, 28 external interrupts, each has 4 priority levels

Memories
  Flash size from 16KB to 64 KB
  SRAM size from 4KB to 8 KB with HW parity checking
  3KB ISP loader ROM
  1KB OTP byte

Low power management
  Power saving mode: sleep, deep-sleep, standby mode
  Independent battery supply for real-calendar RTC and backup register

Advanced analog peripherals
  1 x 12bit, 1us ADC (up to 10 chs)

Integrated peripherals interface
  Up to 2 x USART/UART/Irda/LIN/ISO7816
  Up to 2 x SPI (18Mbit/s)
  Up to 2 x I2C (400Kbit/s)

On-chip resources
  1 x 16 bit Advanced Timer, 1 x SysTick Timer, 5 x 16 bit GPTM, 1x 16bit basic Timer, 2 x WDG
  5-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
  2 x OPAMP
  System supervisor and reset: POR,PDR,LVD
  80% GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HSI (8MHz), LSI (40KHz)
      </description>

      <feature type="WDT"           n="2"/>
      <feature type="RTC"           n="32768"/>
      <feature type="ADC"           n="1"       m="12"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="VCC"           n="2.40"    m="3.60"/>


      <!-- *************************  Device 'GD32E231C4'  ***************************** -->
      <device Dname="GD32E231C4">
         <memory    id="IROM1"                   start="0x08000000" size="0x0004000" startup="1" default="1"/>
         <memory    id="IRAM1"                   start="0x20000000" size="0x0001000" init   ="0" default="1"/>
          <debug svd="SVD/GD32E231.svd"/>
         <algorithm name="Flash/GD32E23x.FLM" start="0x08000000" size="0x004000" default="1"/>
      </device>  

      <!-- *************************  Device 'GD32E231C6'  ***************************** -->
      <device Dname="GD32E231C6">
         <memory    id="IROM1"                   start="0x08000000" size="0x0008000" startup="1" default="1"/>
         <memory    id="IRAM1"                   start="0x20000000" size="0x0001800" init   ="0" default="1"/>
          <debug svd="SVD/GD32E231.svd"/>
         <algorithm name="Flash/GD32E23x.FLM" start="0x08000000" size="0x008000" default="1"/>
      </device>  

      <!-- *************************  Device 'GD32E231C8'  ***************************** -->
      <device Dname="GD32E231C8">
         <memory    id="IROM1"                   start="0x08000000" size="0x0010000" startup="1" default="1"/>
         <memory    id="IRAM1"                   start="0x20000000" size="0x0002000" init   ="0" default="1"/>
          <debug svd="SVD/GD32E231.svd"/>
         <algorithm name="Flash/GD32E23x.FLM" start="0x08000000" size="0x0010000" default="1"/>
      </device>  


     </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="GD32E23x">
      <description>GigaDevice GD32E23x Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32E23[01]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="GD32E23x CMSIS">
      <description>GigaDevice GD32E23x Devices and CMSIS-CORE</description>
      <require condition="GD32E23x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GD32E23x_libopt"/>    
      <require Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="RCU"/>           
    </condition>

    <!-- GD32E23x STDPERIPHERALS RCU Conditions -->
    <condition id="GD32E23x STDPERIPHERALS RCU">
      <description>GigaDevice  GD32E23x Standard Peripherals Drivers with RCU</description>
      <require condition="GD32E23x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="RCU"/>
    </condition>

