vvpai9/Keil/Keil_v5/ARM/Pack/.Web/GigaDevice.GD32E23x_DFP.pdsc
     <!-- GD32E23x STDPERIPHERALS MISC Conditions -->
    <condition id="GD32E23x STDPERIPHERALS MISC">
      <description>GigaDevice  GD32E23x Standard Peripherals Drivers with MISC</description>
      <require condition="GD32E23x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="MISC"/>
    </condition>

     <!-- GD32E23x STDPERIPHERALS EVAL Conditions -->
    <condition id="GD32E23x STDPERIPHERALS EVAL">
      <description>GigaDevice  GD32E23x Standard Peripherals Drivers with EVAL</description>
      <require condition="GD32E23x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="EXTI"/>
      <require Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="USART"/>
      <require Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="SYSCFG"/>
    </condition>
  </conditions>

  <components>
  <!-- GD32E23x_StdPeripherals -->
    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="ADC" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_adc.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_adc.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="CMP" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CMP
        </RTE_Components_h>
        <files>
          <!-- CRC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_cmp.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_cmp.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="CRC" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_crc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_crc.c" attr="config" version="1.0.0" />
        </files>
    </component>


    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="DBG" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>Debug (DBG) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
        </RTE_Components_h>
        <files>
          <!-- DBG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_dbg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_dbg.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="DMA" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_dma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_dma.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="EXTI" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
        </RTE_Components_h>
        <files>
          <!-- EXTI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_exti.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_exti.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="FMC" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
        </RTE_Components_h>
        <files>
          <!-- FMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_fmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_fmc.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="FWDGT" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>Free watchdog timer(FWDGT) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FWDGT
        </RTE_Components_h>
        <files>
          <!-- FWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_fwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_fwdgt.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="GPIO" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_gpio.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="I2C" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_i2c.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="MISC" Cversion="1.0.0" condition="GD32E23x CMSIS">
      <description>MISC driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_misc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_misc.c" attr="config" version="1.0.0" />
        </files>
    </component>

