vvpai9/Keil/Keil_v5/ARM/Pack/.Web/GigaDevice.GD32E23x_DFP.pdsc
    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="PMU" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
        </RTE_Components_h>
        <files>
          <!-- PMU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_pmu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_pmu.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="RCU" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS MISC">
      <description>Reset and Clock Control (RCU) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RCU
        </RTE_Components_h>
        <files>
          <!-- RCU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_rcu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_rcu.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="RTC" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>Real-time Clock (RTC) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
        <files>
          <!-- RTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_rtc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_rtc.c" attr="config" version="1.0.0" />
        </files>
    </component>


    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="SPI_I2S" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_spi.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="SYSCFG" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SYSCFG
        </RTE_Components_h>
        <files>
          <!-- SPI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_syscfg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_syscfg.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="TIMER" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>TIMER driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TIMER
        </RTE_Components_h>
        <files>
          <!-- TIMER flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_timer.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_timer.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="USART" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_usart.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E23x_StdPeripherals" Csub="WWDGT" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32E23x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
        </RTE_Components_h>
        <files>
          <!-- WWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e23x_wwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e23x_wwdgt.c" attr="config" version="1.0.0" />
        </files>
    </component>

    <!-- Utilities GD32E23x -->
    <component Cclass="Device" Cgroup="EVAL" Csub="GD32E23x" Cversion="1.0.0" condition="GD32E23x STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32e230c_eval.h" />
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32e230c_eval.c" attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Config GD32E23x -->
    <component Cclass="Device" Cgroup="GD32E23x_libopt" Cversion="1.0.0" condition="GD32E23x CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Include/gd32e23x_libopt.h"/>
      </files>
    </component>

   <!-- Startup GD32E23x  -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="1.0.0" condition="GD32E23x">
      <description>System Startup for GigaDevice GD32E23x  Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32e23x.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32e23x.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32e23x.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>
</package>
